benchmarks/example-webserver-wrk-u18-adjusted-ulimit.txt
Running 2m test @ http://localhost:5000/v1/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   176.51ms   32.00ms   1.67s    95.90%
    Req/Sec   185.53     42.64   333.00     74.00%
  Latency Distribution
     50%  170.86ms
     75%  173.76ms
     90%  178.00ms
     99%  328.44ms
  264893 requests in 2.00m, 48.80MB read
  Socket errors: connect 0, read 85, write 0, timeout 0
Requests/sec:   2206.00
Transfer/sec:    416.12KB